org/_posts/Perl/2013-01-08-list-module-you-have-installed.org
#+BEGIN_HTML
---
layout: tech-post
title: 列出你安装的Perl模块
category: Perl
change_frequency: monthly
---
#+END_HTML

有时候，我们想知道自己的机器上安装了哪些Perl模块，可以通过下面的方式:

*** perllocal

#+begin_src sh
perldoc perllocal
#+end_src

这条命令是perl自带的，它会列出每个安装的模块，包括安装时间和具体信息。

我们可以通过grep方便找出这个模块列表：

#+begin_src sh :exports both :results output :eval no-export
  perldoc -t perllocal | grep "Module" | head -10
#+end_src  

#+RESULTS:
#+begin_example
  Sun Mar 31 15:08:23 2013: "Module" Try::Tiny
  Sun Mar 31 15:08:23 2013: "Module" Test::Fatal
  Sun Mar 31 15:08:29 2013: "Module" Sub::Install
  Sun Mar 31 15:08:33 2013: "Module" Params::Util
  Sun Mar 31 15:08:34 2013: "Module" Data::OptList
  Sun Mar 31 15:08:36 2013: "Module" Sub::Exporter
  Sun Mar 31 15:08:40 2013: "Module" List::MoreUtils
  Sun Mar 31 15:08:42 2013: "Module" Dist::CheckConflicts
  Sun Mar 31 15:08:45 2013: "Module" Test::Requires
  Sun Mar 31 15:08:47 2013: "Module" Sub::Name
#+end_example


*** instmodsh

*instmodsh* 是 *Ext::Utils::Installed* 模块提供的一个可执行脚本,可以打印出目前安装的模块.\\
*Ext::Utils::Installed* 是根据模块安装时候生成的.packlist(存放在每个模块的目录下面) 文件来分析出已经安装的模块.

#+BEGIN_SRC sh :eval no-export :exports both :results output
(echo l ; echo q ) | instmodsh | sed -e '1,/:/d' -e '/cmd?/d' | head -10
#+END_SRC

#+RESULTS:
#+begin_example
   Algorithm::Diff
   App::Cmd
   App::cpanminus
   AppConfig
   B::Hooks::EndOfScope
   B::Keywords
   CPAN::Meta::Check
   CPAN::Uploader
   Capture::Tiny
   Carp::Clan
#+end_example


*Come from* [[<http://www.cpan.org/misc/cpan-faq.html>][CPAN-FAQ]]
